#todo:  Напишите программу, которая получает на вход строку, и определяет,
# является ли строка панграммой (т.е. содержатся ли в ней все 33 буквы русского алфавита).

alpha = {'а', 'б', 'в', 'г', 'д',
           'е', 'ё', 'ж', 'з', 'и',
           'й','к', 'л', 'м', 'н',
           'о', 'п', 'р', 'с', 'т',
           'у', 'ф', 'х', 'ц', 'ч',
           'ш', 'щ', 'ъ', 'ы', 'ь',
           'э', 'ю', 'я'}

a = input()

c = alpha.intersection(a)


print("Строка является панграммой!" if len(c) == 33 else "Строкая не является панграммой!")