#todo: Напишите программу, которая:
# Получает на вход две строки, в которых перечисляются книги, прочитанные двумя учениками.
# Выводит количество книг, которые прочитали оба ученика.
# Пример ввода:
# Война и мир, Над пропастью во ржи, Мастер и Маргарита, Идиот
# Евгений Онегин, Идиот, Мастер и Маргарита, Война и мир

txt1 = input("Введите перечень книг прочитанные первым учеником: ")
txt2 = input("Введите перечень книг прочитанные вторым учеником: ")

print("Оба ученика прочитали: ", len(txt1.split(',')) + len(txt2.split(',')), " книг")