##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

x = 7
y = 2
print("Дано два числа: Х = ", x, "; Y = ", y)
print("Сумма: ", x + y)
print("Разность: ", x - y)
print("Частное: ", x / y)
print("Произведение: ", x * y)
print("Целочисленное деление: ", x // y)
print("Деление с остатком: ", x % y)
print("Возведение в степень: ", x ** y)