# todo:
#     Напишите программу, которая определяет и печатает «похожие» слова. Слово называется похожим на другое слово,
#     если его гласные буквы находятся там же, где находятся гласные буквы другого слова, например:
#     дорога и пароход - похожие слова (гласные буквы на втором, четвертом и шестом местах),
#     станок и прыжок - похожие слова, питон и удав непохожие слова.
#     Считаем, что в русском языке 10 гласных букв (а, у, о, ы, и, э, я, ю, ё, е).
#     Ввод: x –первое слово, например, питон. n – количество слов для сравнения, например 6.
#     Дальше вводятся 6 слов, например: поросенок, титан, итог, лавка, погост, кино.
#     Вывод - слова, похожие на питон: титан, погост, кино

def kort(l):
    k = {}
    for i in range(len(l)):
        k[i] = l[i]

    return k

word = "питон"
list_words = ["поросенок", "титан", "итог", "лавка", "погост", "кино"]

glas = ['а', 'у', 'о', 'ы', 'и', 'э', 'я', 'ю', 'ё', 'е']

good_words = []
bad_words = []
tmp = []

frst = list(set(word) & set(glas))
for i in list_words:
    two = [x for x in i if i in word]
    tmp.append(i)


#Не закончил

                



    