# todo: Дан кортеж (123, 234, 345, 456, 567, 678, 789, 890).
#  Вводится ещё одно целое число больше 0.
#  Создайте новый кортеж из первого кортежа и введенного числа, чтобы в новом кортеже числа не убывали.

lst = [123, 234, 345, 456, 567, 678, 789, 890]
print("Исходный список: ", lst)

a = input("Введите целое число больше 0: ")

while not a.isdigit():
    a = input("Введите целое число больше 0: ")

a = int(a)

lst.append(a)
lst.sort()

print(lst)