#todo: Вводится число, например: 1231.
# Вывести строчку, например: один два три один.
# Подсказка: создайте словарь

a = {0:"ноль", 1:"один", 2:"два", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять"}

n = input("Введите число: ")

while not n.isdigit():
    n = input("Введите число: ")

n = list(n)

for i in n:
    tmp = int(i)
    print(a.get(tmp, 0), end = " ")

print("\n\n")
