#todo:
# В Python существуют ключевые слова, которые нельзя использовать для названия переменных, функций и классов. Для получения списка всех ключевых слов можно воспользоваться атрибутом kwlist из модуля keyword. Приведенный ниже код:
# import keyword
# print(keyword.kwlist)
# выводит: ['False', 'None', 'True', 'and', 'as', 'assert', 'async', 'await', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 'with', 'yield']
# Напишите программу, которая принимает строку текста и заменяет в ней все ключевые слова на <kw>.

import keyword

txt = "Ask async for import my day from list"
txt_spl = txt.split()

kw_list = keyword.kwlist

tmp = []
for i in range(len(txt_spl)):
    t = ''
    for j in kw_list:
        if txt_spl[i] == j:
            t = '<kw>'
            break
    tmp.append(t) if not t == '' else tmp.append(txt_spl[i])


print(tmp)